In [1]:
import pandas as pd
df=pd.read_csv('datasets/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [3]:
X=df.drop('Survived',axis='columns')
y=df['Survived']

In [4]:
dummies = pd.get_dummies(X['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
X=pd.concat([X,dummies],axis='columns')
X.drop('Sex',axis='columns',inplace=True)
X

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [8]:
X.isna().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [9]:
X['Age']=X['Age'].fillna(X['Age'].mean())
X.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [13]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [14]:
model.fit(X_train,y_train)

GaussianNB()

In [15]:
model.score(X_test,y_test)

0.7877094972067039

In [19]:
y_test[:10]

513    1
244    0
263    0
422    0
182    0
146    1
716    1
585    1
676    0
183    1
Name: Survived, dtype: int64

In [20]:
model.predict(X_test[:10])

array([1, 0, 0, 0, 0, 0, 1, 1, 0, 0])

In [21]:
model.predict_proba(X_test[:10])

array([[3.71996535e-03, 9.96280035e-01],
       [9.88912441e-01, 1.10875595e-02],
       [9.19351676e-01, 8.06483236e-02],
       [9.88750304e-01, 1.12496961e-02],
       [9.79141948e-01, 2.08580525e-02],
       [9.88349541e-01, 1.16504593e-02],
       [3.53472195e-09, 9.99999996e-01],
       [1.22149127e-03, 9.98778509e-01],
       [9.87779507e-01, 1.22204931e-02],
       [9.31508986e-01, 6.84910142e-02]])